#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/private-henrique-percu/github-actions/runs/run-R2SxR8cUyHnGQWQp

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
data.aws_iam_policy_document.ecs_task_execution_policy_document_role: Refreshing...
data.aws_iam_policy_document.ecs_task_execution_policy_document_role: Refresh complete after 0s [id=320642683]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.demo_ecr will be created
  + resource "aws_ecr_repository" "demo_ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "demo_ecs_repository"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Env"  = "demo"
          + "Name" = "demo_ecs_cluster"
        }
      + tags_all             = {
          + "Env"  = "demo"
          + "Name" = "demo_ecs_cluster"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecs_cluster.demo_ecs_cluster will be created
  + resource "aws_ecs_cluster" "demo_ecs_cluster" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "demo_ecs_cluster"
      + tags               = {
          + "Env"  = "demo"
          + "Name" = "demo_ecs_cluster"
        }
      + tags_all           = {
          + "Env"  = "demo"
          + "Name" = "demo_ecs_cluster"
        }
    }

  # aws_iam_role.ecs_task_execution_iam_role will be created
  + resource "aws_iam_role" "ecs_task_execution_iam_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecsTaskExecutionRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_task_execution_role will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "ecsTaskExecutionRole"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```
</details>
*Pushed by: @HenriquePercu, Action: `pull_request`*